Os comandos abaixo carregam o famoso dataset do titanic no objeto chamado *df*. Explore a tabela e responda as seguintes questões **sempre colocando o código em Python utilizado para chegar às respostas.**

1) Quantas pessoas sobreviveram ao acidente?
2) Quantas criancas menores de 12 anos sobreviveram ao acidente?
3) Quantas pessoas embarcaram nos portos de Southampton OU Queenstow?
4) Crie um objeto chamado **passageiras** que seleciona somente as passageiras.
5) Crie um objeto chamado **criancas_cherbourg** que seleciona as crianças com menos de 12 anos E que embarcaram na cidade de Cherbourg.
6) Crie um objeto chamado **titanic_menor** e selecione as colunas de *nome*, *idade*, *classe* e *embarque*
7) Supondo que o valor da tarifa no dataset está em libras, e que 1£ = R$ 6.43, crie uma nova coluna chamada **tarifa_real** que contenha a tarifa de embarque em reais.
8) Agrupe pela coluna sobreviveu e calcule o número de passageiros por grupo (sim/nao)
9) Agrupe pelo local de embarque e calcule a média e a mediana da tarifa de cada grupo.
10) Agrupe pela classe e conte a quantidade de pessoas por classe
11) Agrupe pela classe e pela coluna sobreviveu e conte a quantidade de pessoas que sobreviveu de acordo com cada classe. Quem sobreviveu mais? A classe mais alta ou a mais baixa?
12) Agrupe pelo sexo e pela coluna sobreviveu e conte a quantidade de pessoas que sobreviveram de acordo com o sexo. Quem sobreviveu mais? Homens ou mulheres?

In [1]:
import pandas as pd

In [2]:
#Exercício 1
df = pd.read_csv('../dados/titanic.csv')
df[(df['sobreviveu']) == 'sim'].count()[0]

342

In [3]:
#Exercício 2
df[(df['sobreviveu'] == 'sim') & (df['idade'] < 12)].count()[0]

39

In [4]:
#Exercício 3
df[(df['embarque'] == 'Southampton') | (df['embarque'] == 'Queenstow')].count()[0]

721

In [5]:
#Exercício 4
passageiras = df.loc[(df['sexo']) == 'feminino']
passageiras.count()[0]

314

In [6]:
#Exercício 5
criancas_cherbourg = df.loc[(df['idade'] < 12.0) & (df['embarque'] == 'Cherbourg')]
criancas_cherbourg.count()[0]

10

In [8]:
#Exercício 6
colunas = ['nome','idade','classe','embarque']
titanic_menor = df.loc[:,colunas]

In [10]:
#Exercício 7
df['tarifa_real'] = df['tarifa']*6.43

In [29]:
#Exercício 8
df[['sobreviveu','id_passageiro']].groupby(['sobreviveu']).count()

            id_passageiro
sobreviveu
nao                   549
sim                   342

In [30]:
#Exercício 9
df[['embarque','tarifa']].groupby(['embarque']).agg(['mean', 'median'])

                   tarifa
                     mean   median
embarque
Cherbourg    12709.345662  37.0042
Queenstow     2002.842913   7.7500
Southampton   2015.306986  18.7500

In [31]:
#Exercício 10
df[['classe','id_passageiro']].groupby(['classe']).count()

        id_passageiro
classe
1                 216
2                 184
3                 491

In [36]:
#Exercício 11
df[['classe','sobreviveu','id_passageiro']].groupby(['classe','sobreviveu']).count()

                   id_passageiro
classe sobreviveu
1      nao                    80
       sim                   136
2      nao                    97
       sim                    87
3      nao                   372
       sim                   119

In [37]:
#Exercício 12
df[['sexo','sobreviveu','id_passageiro']].groupby(['sexo','sobreviveu']).count()

                      id_passageiro
sexo      sobreviveu
feminino  nao                    81
          sim                   233
masculino nao                   468
          sim                   109